
// أنشئ متغيرًا باسم userName وضع داخله اسمًا(مثل: “محمد”).
// أنشئ متغيرًا باسم userAge وضع داخله رقمًا(مثل: 25).
// أنشئ متغيرًا باسم isSubscribed وضع داخله قيمة true أو false.
// طباعة القيم الأولى:

// استخدم console.log لطباعة جملة مثل:
// الاسم: محمد، العمر: 25، الاشتراك: فعال.
// تعديل القيم:

// عدّل قيم المتغيرات إلى اسم آخر وعمر مختلف، وقم بتغيير حالة الاشتراك.
// إعادة الطباعة:




let userName = "yaman";
let userAge =22;
let isSubscribed = true;
console.log(`الاسم:${userName} ، العمر: ${userAge} ، الاشتراك :${isSubscribed ? "فعال " : "غير فعال"}`);



