// قم بكتابة برنامج يحسب مساحة مستطيل باستخدام:
// الطول = 10.
// العرض = 5.
// اكتب كوداً يتحقق إذا كان الرقم المدخل:
// أكبر من 10 وأقل من 20 باستخدام &&.
// أقل من 5 أو أكبر من 15 باستخدام ||.
// التعامل مع الباقي:

// اكتب برنامج يتحقق إذا كان الرقم المدخل يقبل القسمة على 3 بدون باقي.
// أوجد باقي القسمة عند تقسيم 100 على 7.

let length = 10;
let width = 5;
let area = length * width;
// console.log(`:${area}مساحة المستطيل هي`)
if (area > 10 && area < 20) {
    console.log("المساحة أكبر من 10 وأقل من 20: true");
}
else { console.log("المساحة ليست أكبر من 10 وأقل من 20: false"); }


if (area > 14 || area < 5) { console.log("المساحة أقل من 5 أو أكبر من 15: true"); }
else { console.log("المساحة ليست أكبر من 10 وأقل من 20: false"); }

if (area % 3 === 0) { console.log("يقبل"); }
else { console.log("لا تقبل"); }


let x = 100;
let y = 7;
console.log(100 % 7)



